In [1]:
# 3rd party
import pandas as pd

In [3]:
df = pd.DataFrame([{'Name': 'Chris', 'Item Purchased': 'Sponge', 'Cost': 22.50},
                  {'Name': 'Kevyn', 'Item Purchased': 'Kitty Litter', 'Cost': 2.50},
                  {'Name': 'Filip', 'Item Purchased': 'Spoon', 'Cost': 5.00}],
                 index=['Store 1', 'Store 1', 'Store 2'])
df

         Cost Item Purchased   Name
Store 1  22.5         Sponge  Chris
Store 1   2.5   Kitty Litter  Kevyn
Store 2   5.0          Spoon  Filip

In [4]:
df['Date'] = ['December 1', 'January 1', 'mid-May']
df

         Cost Item Purchased   Name        Date
Store 1  22.5         Sponge  Chris  December 1
Store 1   2.5   Kitty Litter  Kevyn   January 1
Store 2   5.0          Spoon  Filip     mid-May

In [5]:
df['Delivered'] = True
df

         Cost Item Purchased   Name        Date  Delivered
Store 1  22.5         Sponge  Chris  December 1       True
Store 1   2.5   Kitty Litter  Kevyn   January 1       True
Store 2   5.0          Spoon  Filip     mid-May       True

In [6]:
df['Feedback'] = ['Positive', None, 'Negative']
df

         Cost Item Purchased   Name        Date  Delivered  Feedback
Store 1  22.5         Sponge  Chris  December 1       True  Positive
Store 1   2.5   Kitty Litter  Kevyn   January 1       True      None
Store 2   5.0          Spoon  Filip     mid-May       True  Negative

In [8]:
adf = df.reset_index()
adf['Date'] = pd.Series({0: 'December', 2: 'mid-May'})
adf

     index  Cost Item Purchased   Name      Date  Delivered  Feedback
0  Store 1  22.5         Sponge  Chris  December       True  Positive
1  Store 1   2.5   Kitty Litter  Kevyn       NaN       True      None
2  Store 2   5.0          Spoon  Filip   mid-May       True  Negative

In [12]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR'},
                         {'Name': 'Sally', 'Role': 'Course Liason'},
                         {'Name': 'James', 'Role': 'Grader'}])
staff_df = staff_df.set_index('Name')

student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business'},
                           {'Name': 'Mike', 'School': 'Law'},
                           {'Name': 'Sally', 'School': 'Engineering'}])
student_df = student_df.set_index('Name')

print(staff_df)
print()
print(student_df)

                 Role
Name
Kelly  Director of HR
Sally   Course Liason
James          Grader

            School
Name
James     Business
Mike           Law
Sally  Engineering

In [13]:
pd.merge(staff_df, student_df, how='outer', left_index=True, right_index=True)

                 Role       School
Name
James          Grader     Business
Kelly  Director of HR          NaN
Mike              NaN          Law
Sally   Course Liason  Engineering

In [14]:
pd.merge(staff_df, student_df, how='inner', left_index=True, right_index=True)

                Role       School
Name
Sally  Course Liason  Engineering
James         Grader     Business

In [15]:
pd.merge(staff_df, student_df, how='left', left_index=True, right_index=True)

                 Role       School
Name
Kelly  Director of HR          NaN
Sally   Course Liason  Engineering
James          Grader     Business

In [16]:
pd.merge(staff_df, student_df, how='right', left_index=True, right_index=True)

                Role       School
Name
James         Grader     Business
Mike             NaN          Law
Sally  Course Liason  Engineering

In [17]:
staff_df = staff_df.reset_index()
student_df = student_df.reset_index()
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

    Name            Role       School
0  Kelly  Director of HR          NaN
1  Sally   Course Liason  Engineering
2  James          Grader     Business

In [19]:
staff_df = pd.DataFrame([{'Name': 'Kelly', 'Role': 'Director of HR', 'Location': 'State Street'},
                         {'Name': 'Sally', 'Role': 'Course Liason', 'Location': 'Washington Avenue'},
                         {'Name': 'James', 'Role': 'Grader', 'Location': 'Washington Avenue'}])
staff_df = staff_df.set_index('Name')

student_df = pd.DataFrame([{'Name': 'James', 'School': 'Business', 'Location': '1024 Biliard Avenue'},
                           {'Name': 'Mike', 'School': 'Law', 'Location': 'Fraternity House #22'},
                           {'Name': 'Sally', 'School': 'Engineering', 'Location': '512 Wilson Crescent'}])
student_df = student_df.set_index('Name')

print(staff_df)
print()
print(student_df)

                Location            Role
Name
Kelly       State Street  Director of HR
Sally  Washington Avenue   Course Liason
James  Washington Avenue          Grader

                   Location       School
Name
James   1024 Biliard Avenue     Business
Mike   Fraternity House #22          Law
Sally   512 Wilson Crescent  Engineering

In [20]:
pd.merge(staff_df, student_df, how='left', left_on='Name', right_on='Name')

              Location_x            Role           Location_y       School
Name
Kelly       State Street  Director of HR                  NaN          NaN
Sally  Washington Avenue   Course Liason  512 Wilson Crescent  Engineering
James  Washington Avenue          Grader  1024 Biliard Avenue     Business